new_2022.12.15/MTO_fluid/app/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.01;
vertices
(
    (0 0 -0.0025)
    (0.5 0 -0.0025)
    (0.5 1 -0.0025)
    (0 1 -0.0025)
    (0.5 1.2 -0.0025)
    (0.4 1.2 -0.0025)
    (0.4 1 -0.0025)
    (0.4 0 -0.0025)
    (0.4 -0.2 -0.0025)
    (0.5 -0.2 -0.0025)

    (0 0 0)
    (0.5 0 0)
    (0.5 1 0)
    (0 1 0)
    (0.5 1.2 0)
    (0.4 1.2 0)
    (0.4 1 0)
    (0.4 0 0)
    (0.4 -0.2 0)
    (0.5 -0.2 0)  
);



blocks
(
    hex (0 7 6 3 10 17 16 13)
    (160 400 1)
    simpleGrading (1 1 1)

    hex (7 1 2 6 17 11 12 16)
    test_area
    (40 400 1)
    simpleGrading (1 1 1)

    hex (6 2 4 5 16 12 14 15)
    fluid_area
    (40 80 1)
    simpleGrading (1 1 1)

    hex (1 7 8 9 11 17 18 19)
    fluid_area
    (40 80 1)
    simpleGrading (1 1 1)
);
/*
vertices
(
    (0 0 -0.005)
    (0.5 0 -0.005)
    (0.5 1 -0.005)
    (0 1 -0.005)
    (0.5 1.2 -0.005)
    (0.4 1.2 -0.005)
    (0.4 1 -0.005)
    (0.4 0 -0.005)
    (0.4 -0.2 -0.005)
    (0.5 -0.2 -0.005)

    (0 0 0)
    (0.5 0 0)
    (0.5 1 0)
    (0 1 0)
    (0.5 1.2 0)
    (0.4 1.2 0)
    (0.4 1 0)
    (0.4 0 0)
    (0.4 -0.2 0)
    (0.5 -0.2 0)  
);



blocks
(
    hex (0 7 6 3 10 17 16 13)
    (80 200 1)
    simpleGrading (1 1 1)

    hex (7 1 2 6 17 11 12 16)
    zone_test
    (20 200 1)
    simpleGrading (1 1 1)

    hex (6 2 4 5 16 12 14 15)
    zone_flow
    (20 40 1)
    simpleGrading (1 1 1)

    hex (1 7 8 9 11 17 18 19)
    zone_flow
    (20 40 1)
    simpleGrading (1 1 1)
);
*/
edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (4 5 15 14)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (19 18 8 9)
        );
    }
    Wall
    {
        type wall;
        faces
        (
            (0 10 13 3)
            (0 7 17 10)
            (7 8 18 17)
            (5 6 16 15)
            (6 3 13 16)
        );
    }
    right
    {
        type symmetry;
        faces
        (
            (1 2 12 11)
            (2 4 14 12)
            (9 1 11 19)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 6 7)
            (6 2 1 7)
            (9 8 7 1)
            (6 5 4 2)
            (10 17 16 13)
            (17 11 12 16)
            (11 17 18 19)
            (12 14 15 16)
        );
    }
);
mergePatchPairs
(
);

// ************************************************************************* //
