new_2022.12.15/MTO_fluid/app/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       172040;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       172080;
    }
    Wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          880;
        startFace       172120;
    }
    right
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          560;
        startFace       173000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          172800;
        startFace       173560;
    }
)

// ************************************************************************* //
