new_2022.12.15/MTO_fluid/app/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(D|Da)"
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.9;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }
    "(p|pa|pb|pc)"
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(U|Ua|Ub|Uc|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-8;
        relTol          0.1;
    }
     "(T)"
    {
        solver          GAMG;
        preconditioner  DILU;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }  
     "(Ta|Tb)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
     "(xp|fsensMeanT|gsensVol|gsensPowerDiss)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
 //   nCorrectors 2;
// nOuterCorrectors 10;
    pRefCell 0;
    pRefValue 0;

}

relaxationFactors
{
    fields
    {
        "(p|pa|pb|pc)"     0.3;
        alpha           0.1;
    }
    equations
    {
        "(U|Ua|Ub|Uc)"     0.7;
        "(k|epsilon)"   0.7;
    }
}
constraintFunctionDict_flow
{
    numberConstraintPatches      2;
    constraintPatchesNames       (inlet outlet);
}
constraintFunctionDict_solid
{
    numberConstraintPatches      1;
    constraintPatchesNames       (force);
}
// ************************************************************************* //
